#################################
#Напишите программный код, который будет создавать новый список,
#содержащий в качестве элементов квадратные корни всех чисел из списка [2, 4, 9, 16, 25]:
#1) на основе цикла for
#2) на основе функции map
#3) в виде генератора списка

import math
lst = [2, 4, 9, 16, 25]
a = []
for i in lst:
    a.append(round(math.sqrt(i), 2))

print('1:', a)
##################################

lst2 = [2, 4, 9, 16, 25]
def f(x):
    return round(math.sqrt(x), 2)

b = list(map(f, lst))
print('2:', b)
################################

lst3 = [2, 4, 9, 16, 25]
c = [round(math.sqrt(i)) for i in lst3]
print('3:', c)